# Analysis of Suicide in India

## Warning - If you're having suicidal thoughts, please call suicide helpline! 

Suicide helpline numbers - http://www.suicide.org/international-suicide-hotlines.html

This dataset contains data from 2001 -2012.

Source - https://www.kaggle.com/rajanand/suicides-in-india

In [22]:
# import packages

import numpy as np
import pandas as pd

In [23]:
# read csv file

df = pd.read_csv('Suicides in India 2001-2012.csv')

df.head()

,State,Year,Type_code,Type,Gender,Age_group,Total
0,A & N Islands,2001,Causes,Illness (Aids/STD),Female,0-14,0
1,A & N Islands,2001,Causes,Bankruptcy or Sudden change in Economic,Female,0-14,0
2,A & N Islands,2001,Causes,Cancellation/Non-Settlement of Marriage,Female,0-14,0
3,A & N Islands,2001,Causes,Physical Abuse (Rape/Incest Etc.),Female,0-14,0
4,A & N Islands,2001,Causes,Dowry Dispute,Female,0-14,0

In [24]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 237519 entries, 0 to 237518
Data columns (total 7 columns):
State        237519 non-null object
Year         237519 non-null int64
Type_code    237519 non-null object
Type         237519 non-null object
Gender       237519 non-null object
Age_group    237519 non-null object
Total        237519 non-null int64
dtypes: int64(2), object(5)
memory usage: 12.7+ MB

In [25]:
df.duplicated().any()

False

In [26]:
df.sample(10)

,State,Year,Type_code,Type,Gender,Age_group,Total
216679,Tripura,2012,Causes,Cancer,Male,0-14,0
33524,Bihar,2012,Means_adopted,By Drowning,Male,0-14,0
3839,A & N Islands,2007,Professional_Profile,Public Sector Undertaking,Female,30-44,0
156924,Mizoram,2003,Means_adopted,By Over Alcoholism,Female,45-59,0
209494,Total (All India),2001,Social_Status,Seperated,Female,0-100+,1137
48084,D & N Haveli,2002,Causes,Death of Dear Person,Female,60+,0
86297,Haryana,2010,Causes,Drug Abuse/Addiction,Female,45-59,0
74796,Gujarat,2001,Professional_Profile,Public Sector Undertaking,Male,60+,2
131921,Madhya Pradesh,2007,Causes,Property Dispute,Female,30-44,6
71218,Goa,2007,Means_adopted,By Over Alcoholism,Female,30-44,0

In [27]:
df.Type_code.value_counts()

Causes                  109200
Means_adopted            67200
Professional_Profile     49263
Education_Status          7296
Social_Status             4560
Name: Type_code, dtype: int64

In [28]:
df.Type.value_counts()

Others (Please Specify)                           7263
By Fire/Self Immolation                           4200
Love Affairs                                      4200
Farming/Agriculture Activity                      4200
Suspected/Illicit Relation                        4200
Family Problems                                   4200
Fall in Social Reputation                         4200
Dowry Dispute                                     4200
By touching electric wires                        4200
By Self Infliction of injury                      4200
By Jumping from (Building)                        4200
Professional/Career Problem                       4200
Unemployed                                        4200
By Jumping off Moving Vehicles/Trains             4200
Insanity/Mental Illness                           4200
House Wife                                        4200
Other Causes (Please Specity)                     4200
Public Sector Undertaking                         4200
Unemployment                                      4200
Property Dispute                                  4200
Causes Not known                                  4200
Poverty                                           4200
Illness (Aids/STD)                                4200
By Consuming Insecticides                         4200
By coming under running vehicles/trains           4200
Failure in Examination                            4200
Paralysis                                         4200
Professional Activity                             4200
By Hanging                                        4200
By Jumping from (Other sites)                     4200
                                                  ...
Retired Person                                    4200
Service (Government)                              4200
By Consuming Other Poison                         4200
Cancellation/Non-Settlement of Marriage           4200
Self-employed (Business activity)                 4200
Ideological Causes/Hero Worshipping               4200
Death of Dear Person                              4200
Service (Private)                                 4200
By Fire-Arms                                      4200
Other Prolonged Illness                           4200
By Overdose of sleeping pills                     4200
Bankruptcy or Sudden change in Economic           3850
By Other means (please specify)                   3850
Not having Children(Barrenness/Impotency          3850
Seperated                                          912
Hr. Secondary/Intermediate/Pre-Universit           912
Primary                                            912
No Education                                       912
Graduate                                           912
Married                                            912
Diploma                                            912
Post Graduate and Above                            912
Never Married                                      912
Divorcee                                           912
Middle                                             912
Widowed/Widower                                    912
Matriculate/Secondary                              912
By Other means                                     350
Bankruptcy or Sudden change in Economic Status     350
Not having Children (Barrenness/Impotency          350
Name: Type, Length: 69, dtype: int64

In [29]:
len(df[df['Total'] == 0])

135481

In [30]:
df.State.value_counts()

Madhya Pradesh       6792
Karnataka            6792
Maharashtra          6792
Odisha               6791
Andhra Pradesh       6791
Rajasthan            6791
Chhattisgarh         6790
Haryana              6790
Bihar                6790
Kerala               6788
Uttar Pradesh        6787
Assam                6786
Gujarat              6786
Tamil Nadu           6786
Jharkhand            6785
Delhi (Ut)           6782
Tripura              6782
West Bengal          6780
Punjab               6779
Himachal Pradesh     6774
Jammu & Kashmir      6761
Goa                  6759
Uttarakhand          6758
Sikkim               6742
Mizoram              6737
Meghalaya            6733
Puducherry           6730
Chandigarh           6717
A & N Islands        6712
Daman & Diu          6710
Arunachal Pradesh    6707
Nagaland             6705
D & N Haveli         6704
Manipur              6700
Lakshadweep          6674
Total (Uts)           312
Total (All India)     312
Total (States)        312
Name: State, dtype: int64

In [31]:
df.Age_group.value_counts()

15-29     45223
30-44     45193
45-59     45146
60+       45074
0-14      45027
0-100+    11856
Name: Age_group, dtype: int64

### Data Wrangling

<ul>
<li> Drop rows whose total is zero</li>
<li> Drop rows where state is "Total %"</li>    
</ul>

In [32]:
# Drop rows where total is zero.

df = df.drop(df[df.Total==0].index)

In [33]:
df[df['Total']==0]

Empty DataFrame
Columns: [State, Year, Type_code, Type, Gender, Age_group, Total]
Index: []

In [38]:
df = df.drop(df[(df.State == 'Total (Uts)') | (df.State == 'Total (All India)') | 
               (df.State == 'Total (States)')].index)

In [39]:
df.State.value_counts()

Andhra Pradesh       5185
Karnataka            5115
Tamil Nadu           5054
Madhya Pradesh       5029
Maharashtra          4958
Uttar Pradesh        4954
Gujarat              4856
West Bengal          4596
Kerala               4509
Chhattisgarh         4368
Rajasthan            4324
Odisha               4179
Assam                3868
Haryana              3826
Delhi (Ut)           3324
Jharkhand            3210
Bihar                3119
Punjab               2960
Himachal Pradesh     2650
Tripura              2451
Uttarakhand          2442
Goa                  2237
Jammu & Kashmir      2159
Puducherry           2124
Sikkim               1421
A & N Islands        1299
Meghalaya            1180
Chandigarh           1092
Arunachal Pradesh    1062
D & N Haveli          952
Mizoram               786
Manipur               609
Nagaland              587
Daman & Diu           579
Lakshadweep            46
Name: State, dtype: int64

### Analysis